# Lab Session

## <font color='blue'> Table Of Contents </font>
- Problem Statement 
- Load required libraries
- Connect to DB using mysql-connector-python package
- Create database named `e_commerce`
- Create tables and insert data into tables as specified in the question
- Read all the questions and write sql queries to meet the objective

## <font color='blue'> Problem Statement </font>
###  An E-commerce website manages its data in the form of various tables.
You need to create a Database called `e_commerce` and various tables in it. The tables needed and attributes which need to be in every table are given before hand. All you have to do is create tables with data in it and answer some of the questions that follows.

### Load Required Libraries

In [44]:
import mysql.connector
import pandas as pd

### Connect to DB using Mysql-connector-python package

In [45]:
## Lets connect to Mysql server and choose the database('e_commerce') while connecting to the server
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="Coc@0611")
# creating a cursor object
cursorObject = connection.cursor()

### You are required to create a database named 'e_commerce'

In [46]:
## Lets make a connection to Mysql server and create a database named 'e_commerce'
connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="Coc@0611")
 
## creating a cursor object
cursorObject = connection.cursor()
 
## creating database
cursorObject.execute("CREATE DATABASE ecommerce")

## closing the connection after creating a database('e_commerce')
connection.close()

### Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.


- **`supplier`**(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))


- **`customer`** (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))


- **`category`** (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))


- **`product`** (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))


- **`product_details`** (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
  PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))
  
  
- **`order`** (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))


- **`rating`** (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))

In [19]:
## Again connect to the Mysql server and while connecting Choose 'e_commerce' database

connection = mysql.connector.connect(host ="localhost",
                                     user ="root",
                                     passwd ="Coc@0611",
                                     database = 'ecommerce')
 
## creating a cursor object
cursorObject = connection.cursor()

supplier = """create table `supplier`(SUPP_ID int primary key, SUPP_NAME varchar(50), 
              SUPP_CITY varchar(50), SUPP_PHONE varchar(10))""";
                         
customer = """create table `customer`(CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL,
              CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID));"""
 
category = """create table `category`(CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,
              PRIMARY KEY (CAT_ID));"""                      
                     
product = """create table `product`(PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, 
            PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),
            FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID));"""

product_details = """create table `product_details`(PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, 
                    PROD_PRICE INT NOT NULL,PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID),
                    FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID));"""

rating = """create table `rating`(RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, 
            RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),
            FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID));"""
                         
orders = """create Table `orders`(
            ORD_ID INT NOT NULL,
            ORD_AMOUNT FLOAT NOT NULL,
            ORD_DATE DATE,
            CUS_ID INT NOT NULL,
            PROD_ID INT NOT NULL,
            PRIMARY KEY (ORD_ID),
            FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),
            FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID)
            );
            """
                        
                  
# # Executing the query
# cursorObject.execute(table_creation_query,multi=True)


## Used multiple queries since single query not working for my version of SQL database.

cursorObject.execute(supplier)
cursorObject.execute(customer)
cursorObject.execute(category)
cursorObject.execute(product)
cursorObject.execute(product_details)
cursorObject.execute(orders)     
cursorObject.execute(rating)

### Q2. Insert the following data in the table created above
#### `Note:` If you are getting any error while inserting the data into tables, Kindly close the connection and reconnect

#### Table:  supplier
| SUPP_ID | SUPP_NAME | SUPP_CITY | SUPP_PHONE |
| --- | --- | --- | --- | 
| 1 | Rajesh Retails | Delhi | 1234567890 |
| 2 | Appario Ltd. | Mumbai | 258963147032 | 
| 3 | Knome products | Bangalore | 9785462315 |
| 4 | Bansal Retails | Kochi | 8975463285 |
| 5 | Mittal Ltd. | Lucknow | 7898456532 |

In [7]:
# insert into "supplier" table
supplier = """INSERT INTO supplier (SUPP_ID , SUPP_NAME, SUPP_CITY, SUPP_PHONE) 
                       VALUES (%s, %s, %s, %s)"""

val = [(1,"Rajesh Retails","Delhi",'1234567890'),
       (2,"Appario Ltd.","Mumbai",'2589631470'),
       (3,"Knome products","Banglore",'9785462315'),
       (4,"Bansal Retails","Kochi",'8975463285'),
       (5,"Mittal Ltd.","Lucknow",'7898456532')]
   
cursorObject.executemany(supplier, val)
connection.commit()

#### Table:  customer
| CUS_ID | CUS_NAME | SUPP_PHONE | CUS_CITY | CUS_GENDER
| --- | --- | --- | --- | --- |
| 1 | AAKASH | 9999999999 | DELHI | M |
| 2 | AMAN | 9785463215 | NOIDA | M |
| 3 | NEHA | 9999999998 | MUMBAI | F |
| 4 | MEGHA | 9994562399 | KOLKATA | F |
| 5 | PULKIT | 7895999999 | LUCKNOW | M |

In [10]:
# insert into "customer" table
customer = """INSERT INTO customer (CUS_ID, CUS_Name, CUS_PHONE, CUS_CITY, CUS_GENDER) 
                       VALUES (%s, %s, %s, %s, %s)"""

val = [
    (1,"AAKASH",'9999999999',"DELHI",'M'),
    (2,"AMAN",'9785463215',"NOIDA",'M'),
    (3,"NEHA",'9999999999',"MUMBAI",'F'),
    (4,"MEGHA",'9994562399',"KOLKATA",'F'),
    (5,"PULKIT",'7895999999',"LUCKNOW",'M')
]

cursorObject.executemany(customer, val)
connection.commit()

#### Table:  category
| CAT_ID | CAT_NAME | 
| --- | --- |  
| 1 | BOOKS |
| 2 | GAMES |  
| 3 | GROCERIES | 
| 4 | ELECTRONICS | 
| 5 | CLOTHES |

In [12]:
# insert into "categoty" table
category = """INSERT INTO category (cat_id , cat_name) 
                       VALUES (%s, %s)"""

val = [
    (1,"BOOKS"),(2,"GAMES"),(3,"GROCERIES"),(4,"ELECTRONICS"),(5,"CLOTHES")
]

cursorObject.executemany(category, val)
connection.commit()

#### Table:  product
| PRO_ID | PRO_NAME | PRO_DESC | CAT_ID |
| --- | --- | --- | --- | 
| 1 | GTA V | DFJDJFDJFDJFDJFJF | 2 |
| 2 | TSHIRT | DFDFJDFJDKFD | 5 | 
| 3 | ROG LAPTOP | DFNTTNTNTERND | 4 |
| 4 | OATS | REURENTBTOTH | 3 |
| 5 | HARRY POTTER | NBEMCTHTJTH | 1 |

In [13]:
# insert into "product" table
product = """INSERT INTO product (PRO_ID , PRO_NAME,PRO_DESC, CAT_ID) 
                       VALUES (%s, %s, %s, %s)"""

val = [
    (1,"GTA V","Windows 7 and above with i5 processor and 8GB RAM",2),
    (2,"TSHIRT","SIZE-L with Black, Blue and White variations",5),
    (3,"ROG LAPTOP","Windows 10 with 15inch screen, i7 processor, 1TB SSD",4),
    (4,"OATS","Highly Nutritious from Nestle",3),
    (5,"HARRY POTTER","Best Collection of all time by J.K Rowling",1)    
]

cursorObject.executemany(product, val)
connection.commit()

#### Table:  product_details
| PROD_ID | PRO_ID | SUPP_ID | PROD_PRICE |
| --- | --- | --- | --- | 
| 1 | 1 | 2 | 1500 |
| 2 | 3 | 5 | 30000 | 
| 3 | 5 | 1 | 3000 |
| 4 | 2 | 3 | 2500 |
| 5 | 4 | 1 | 1000 |

In [14]:
# insert into "product_details" table
product_details = """INSERT INTO product_details (PROD_ID , PRO_ID,SUPP_ID, PROD_PRICE) 
                       VALUES (%s, %s, %s, %s)"""

val = [
    (1,1,2,1500),
    (2,3,5,30000),
    (3,5,1,3000),
    (4,2,3,2500),
    (5,4,1,1000)
]

cursorObject.executemany(product_details, val)
connection.commit()

#### Table:  orders
| ORD_ID | ORD_AMOUNT | ORD_DATE | CUS_ID | PROD_ID
| --- | --- | --- | --- | --- |
| 20 | 1500 | 2021-10-12 | 3 | 5 |
| 25 | 30500 | 2021-09-16 | 5 | 2 |
| 26 | 2000 | 2021-10-05 | 1 | 1 |
| 30 | 3500 | 2021-08-16 | 4 | 3 |
| 50 | 2000 | 2021-10-06 | 2 | 1 |

In [18]:
# insert into "orders" table
orders = """INSERT INTO `orders` (ORD_ID , ORD_AMOUNT,ORD_DATE, CUS_ID,PROD_ID) 
                       VALUES (%s, %s, %s, %s, %s)"""

val = [
    (20,1500,"2021-10-12",3,5),
    (25,30500,"2021-09-16",5,2),
    (26,2000,"2021-10-05",1,1),
    (30,3500,"2021-08-16",4,3),
    (50,2000,"2021-10-06",2,1)
]

cursorObject.executemany(orders, val)
connection.commit()

#### Table: rating
| RAT_ID | CUS_ID | SUPP_ID | RAT_RATSTARS |
| --- | --- | --- | --- | 
| 1 | 2 | 2 | 4 |
| 2 | 3 | 4 | 3 | 
| 3 | 5 | 1 | 5 |
| 4 | 1 | 3 | 2 |
| 5 | 4 | 5 | 4 |

In [20]:
# insert into "rating" table
rating = """INSERT INTO `rating` (RAT_ID , CUS_ID,SUPP_ID, RAT_RATSTARS) 
                       VALUES (%s, %s, %s, %s)"""

val = [
    (1,2,2,4),
    (2,3,4,3),
    (3,5,1,5),
    (4,1,3,2),
    (5,4,5,4)
]

cursorObject.executemany(rating, val)
connection.commit()

### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [26]:
Query_3 = """select cus_gender,count(*) as `Number of Customers` from customer 
                  where cus_id in (select cus_id from `orders` where ord_amount>=3000) group by cus_gender; """

cursorObject.execute(Query_3)
 
output = cursorObject.fetchall()
   
## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['Customer Gender','Number of Customers`'])
output_df

  Customer Gender  Number of Customers`
0               M                     1
1               F                     1

### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [42]:
Query_4 = """select o.*, p.pro_name from orders o, product_details pd, product p 
             where o.cus_id = 2 and o.prod_id=pd.prod_id and pd.pro_id = p.pro_id;"""

cursorObject.execute(Query_4)
 
output = cursorObject.fetchall()
   
## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['Order Id','Order Amount','Order Date', 'Customer Id', 'Product Id', 'Product Name'])
output_df

   Order Id  Order Amount  Order Date  Customer Id  Product Id Product Name
0        50        2000.0  2021-10-06            2           1        GTA V

### Q5) Display the Supplier details who can supply more than one product.

In [29]:

Query_5 = """select * from supplier where Supp_id in 
            (select Supp_id from product_details group by supp_id having count(Prod_id)>1);"""

cursorObject.execute(Query_5)
 
output = cursorObject.fetchall()
   
## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['Supplier Id','Supplier Name','Supplier City', 'Supplier Phone'])
output_df

   Supplier Id   Supplier Name Supplier City Supplier Phone
0            1  Rajesh Retails         Delhi     1234567890

### Q6) Find the category of the product whose order amount is minimum.

In [31]:
Query_6 = """select cat_name from category where cat_id in
            (select p.Cat_id from product p inner join
            (select * from product_details where prod_id =
            (select prod_id from orders having min(ord_amount))) as A 
            on A.pro_id = p.pro_id);"""

cursorObject.execute(Query_6)
 
output = cursorObject.fetchall()
   
## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['Category Name'])
output_df

  Category Name
0     GROCERIES

### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [33]:
Query_7 = """select p.pro_id,p.pro_name from product p inner join 
            (select * from product_details where prod_id in 
            (SELECT prod_id FROM ecommerce.orders where ORD_DATE>"2021-10-05"))as A 
            on A.pro_id=p.pro_id order by pro_id;"""

cursorObject.execute(Query_7)
 
output = cursorObject.fetchall()
   
## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['Product Id', 'Product Name'])
output_df

   Product Id Product Name
0           1        GTA V
1           4         OATS

### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [40]:
Query_8 = """select s.supp_id, s.supp_name,c.cus_name,r.rat_ratstars from rating r 
             inner join supplier s on r.supp_id = s.supp_id 
             inner join customer c on r.cus_id = c.cus_id order by r.rat_ratstars desc limit 3;"""

cursorObject.execute(Query_8)
 
output = cursorObject.fetchall()
   
## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['Supplier Id','Supplier Name','Customer Name', 'Rating'])
output_df

   Supplier Id   Supplier Name Customer Name  Rating
0            1  Rajesh Retails        PULKIT       5
1            2    Appario Ltd.          AMAN       4
2            5     Mittal Ltd.         MEGHA       4

### Q9) Display customer name and gender whose names start or end with character 'A'.

In [34]:
Query_9 = """SELECT CUS_NAME,CUS_GENDER FROM ecommerce.customer where upper(CUS_NAME) Like 'A%' or upper(CUS_NAME) Like '%A';"""

cursorObject.execute(Query_9)
 
output = cursorObject.fetchall()
   
## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['Customer Name', 'Customer Gender'])
output_df

  Customer Name Customer Gender
0        AAKASH               M
1          AMAN               M
2          NEHA               F
3         MEGHA               F

### Q10) Display the total order amount of the male customers.

In [39]:
Query_10 = """select sum(ord_amount) from orders where cus_id in 
             (SELECT Cus_id FROM ecommerce.customer where cus_gender = 'M');"""

cursorObject.execute(Query_10)
 
output = cursorObject.fetchall()
   
## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['Total Amount'])
output_df

   Total Amount
0       34500.0

### Q11) Display all the Customers left outer join with  the orders

In [41]:
Query_11 = """select c.* from customer c left outer join orders o on c.cus_id=o.cus_id;"""

cursorObject.execute(Query_11)
 
output = cursorObject.fetchall()

## Lets put the output of this query in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['Customer Id', 'Customer Name', 'Customer Phone', 'Customer City', 'Customer Gender'])
output_df

   Customer Id Customer Name Customer Phone Customer City Customer Gender
0            1        AAKASH     9999999999         DELHI               M
1            2          AMAN     9785463215         NOIDA               M
2            3          NEHA     9999999999        MUMBAI               F
3            4         MEGHA     9994562399       KOLKATA               F
4            5        PULKIT     7895999999       LUCKNOW               M

In [53]:
connection.close()

**NOTE:** Always close an open connection once you are done with the database operations

## Happy Learning:)